Revit 2024 API
BuiltInFailures.ImportFailures.ATFNonUniformScalingTransform Property
 The imported geometry contains non-uniform scaling transformations which Revit does not support. Some objects may be displaced or distorted.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId ATFNonUniformScalingTransform { get; }
Visual Basic
Public Shared ReadOnly Property ATFNonUniformScalingTransform As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ ATFNonUniformScalingTransform {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.ImportFailures Class
Autodesk.Revit.DB Namespace